In [45]:
import pandas as pd
import pyodbc
import Utils

In [46]:
salesConnection = pyodbc.connect("Driver={SQL Server};"
                                "Server=DESKTOP-8INVJ1O\SQLEXPRESS;"
                                "Database=Sales_db;"
                                "trusted_connection=yes")

In [47]:
sales = pd.read_sql("SELECT * FROM Sales", salesConnection)

C:\Users\Max\AppData\Local\Temp\ipykernel_42920\1864275861.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sales = pd.read_sql("SELECT * FROM Sales", salesConnection)

# Product

In [48]:
sales = Utils.addGuidsUnique(sales, 'Product', 'prod_id')

In [49]:
columns = ['Product', 'Product_Category', 'Sub_Category', 'Unit_Cost']
newFrames = Utils.splitFrames(sales, 'prod_id', columns)
sales = newFrames[0]
productData = newFrames[1]

In [37]:
newColumnNames = ['PRODUCT_id', 'PRODUCT_name' ,'PRODUCT_category', 'PRODUCT_sub_category','PRODUCT_prod_cost']
productData.columns = newColumnNames
productData

,PRODUCT_id,PRODUCT_category,PRODUCT_sub_category,PRODUCT_prod_cost,PRODUCT_name
0,0.0,Hitch Rack - 4-Bike,Accessories,Bike Racks,45.0
596,1.0,All-Purpose Bike Stand,Accessories,Bike Stands,59.0
1048,2.0,Mountain Bottle Cage,Accessories,Bottles and Cages,4.0
1056,3.0,Water Bottle - 30 oz.,Accessories,Bottles and Cages,2.0
1074,4.0,Road Bottle Cage,Accessories,Bottles and Cages,3.0
...,...,...,...,...,...
108780,125.0,"Touring-2000 Blue, 50",Bikes,Touring Bikes,755.0
108864,126.0,"Touring-2000 Blue, 60",Bikes,Touring Bikes,755.0
112074,127.0,"Classic Vest, L",Clothing,Vests,24.0
112080,128.0,"Classic Vest, M",Clothing,Vests,24.0
112090,129.0,"Classic Vest, S",Clothing,Vests,24.0

# Customer

In [38]:
sales = Utils.addGuids(sales, 'CUSTOMER_id')

In [39]:
newFrames = Utils.splitFrames(sales, 'CUSTOMER_id', ['Country', 'State'])
sales = newFrames[0]
customerData = newFrames[1]

In [40]:
newColumnNames = ['CUSTOMER_id','CUSTOMER_country', 'CUSTOMER_state']
customerData.columns = newColumnNames
customerData

,CUSTOMER_id,CUSTOMER_country,CUSTOMER_state
0,417b7953-6398-4a79-ae4f-5878b41d6cef,Canada,British Columbia
1,fd7f19ec-6f51-41e8-8986-2f5ab4512dce,Canada,British Columbia
2,47a8b80d-495c-490d-906b-f1699157f39a,Australia,New South Wales
3,efa0e613-c587-4e43-84b9-5a7d5e7c1dec,Australia,New South Wales
4,6f4b1003-0ed5-49bf-ba7c-8c8700f3ce8c,Australia,New South Wales
...,...,...,...
113031,627459a3-5d3e-472a-98c1-ab2a54db273f,United Kingdom,England
113032,9c2cbbf9-8ec9-41f0-82e7-75e13199c7b4,Australia,Queensland
113033,31215762-a614-4cd7-b58c-c83c553a05e1,Australia,Queensland
113034,74b00a52-471c-4970-ae69-2dc73ce6d57d,France,Seine (Paris)
113035,b7573439-eb09-4707-8da3-927539285484,France,Seine (Paris)

# Day

In [41]:
newFrames = Utils.splitFrames(sales, 'Date', [])
sales = newFrames[0]
dateData = newFrames[1]

In [42]:
dateFormat = '%Y-%m-%d'
DAY_date = Utils.getDayDate(dateData, 'Date', dateFormat)
DAY_date

       DAY_date DAY_MONTH_nr DAY_QUARTER_nr DAY_YEAR_nr
0    2013-11-26           11              4        2013
1    2015-11-26           11              4        2015
2    2014-03-23            3              1        2014
3    2016-03-23            3              1        2016
4    2014-05-15            5              2        2014
...         ...          ...            ...         ...
1879 2011-10-27           10              4        2011
1880 2013-01-06            1              1        2013
1881 2015-01-06            1              1        2015
1882 2012-02-20            2              1        2012
1883 2011-02-20            2              1        2011

[1884 rows x 4 columns]

# Order Detail

In [43]:
selectedColumn = ['Order_Quantity','Unit_Price', 'Date', 'CUSTOMER_id' ,'prod_id']
salesOrderDetail = sales[selectedColumn]
salesOrderDetail

,Order_Quantity,Unit_Price,Date,CUSTOMER_id,prod_id
0,8,120.0,2013-11-26,417b7953-6398-4a79-ae4f-5878b41d6cef,0.0
1,8,120.0,2015-11-26,fd7f19ec-6f51-41e8-8986-2f5ab4512dce,0.0
2,23,120.0,2014-03-23,47a8b80d-495c-490d-906b-f1699157f39a,0.0
3,20,120.0,2016-03-23,efa0e613-c587-4e43-84b9-5a7d5e7c1dec,0.0
4,4,120.0,2014-05-15,6f4b1003-0ed5-49bf-ba7c-8c8700f3ce8c,0.0
...,...,...,...,...,...
113031,3,64.0,2016-04-12,627459a3-5d3e-472a-98c1-ab2a54db273f,129.0
113032,22,64.0,2014-04-02,9c2cbbf9-8ec9-41f0-82e7-75e13199c7b4,128.0
113033,22,64.0,2016-04-02,31215762-a614-4cd7-b58c-c83c553a05e1,128.0
113034,24,64.0,2014-03-04,74b00a52-471c-4970-ae69-2dc73ce6d57d,127.0
113035,23,64.0,2016-03-04,b7573439-eb09-4707-8da3-927539285484,127.0

In [44]:
newColumnNames = ['ORDER_DETAIL_order_quantity', 'ORDER_DETAIL_unit_price', 'DAY_date', 'CUSTOMER_id' ,'PRODUCT_id']
salesOrderDetail.columns = newColumnNames
salesOrderDetail

,ORDER_DETAIL_quantity,ORDER_DETAIL_unit_price,DAY_date,CUSTOMER_id,PRODUCT_id
0,8,120.0,2013-11-26,417b7953-6398-4a79-ae4f-5878b41d6cef,0.0
1,8,120.0,2015-11-26,fd7f19ec-6f51-41e8-8986-2f5ab4512dce,0.0
2,23,120.0,2014-03-23,47a8b80d-495c-490d-906b-f1699157f39a,0.0
3,20,120.0,2016-03-23,efa0e613-c587-4e43-84b9-5a7d5e7c1dec,0.0
4,4,120.0,2014-05-15,6f4b1003-0ed5-49bf-ba7c-8c8700f3ce8c,0.0
...,...,...,...,...,...
113031,3,64.0,2016-04-12,627459a3-5d3e-472a-98c1-ab2a54db273f,129.0
113032,22,64.0,2014-04-02,9c2cbbf9-8ec9-41f0-82e7-75e13199c7b4,128.0
113033,22,64.0,2016-04-02,31215762-a614-4cd7-b58c-c83c553a05e1,128.0
113034,24,64.0,2014-03-04,74b00a52-471c-4970-ae69-2dc73ce6d57d,127.0
113035,23,64.0,2016-03-04,b7573439-eb09-4707-8da3-927539285484,127.0